Repository: GLOWRY11/attendace-app
Catalog: lib/l10n/intl_*.arb
Languages: fr

source: Ready to start?
fr: Prêt à débuter ?

# enseignant
source: Teacher
fr: Enseignant

# fonctionnaire
source: Civil servant
fr: Fonctionnaire

# bienvenue
source: Welcome!
fr: Bienvenue !

# identifiants_invalides
source: Invalid credentials. Please try again.
fr: Identifiants invalides. Veuillez réessayer.

# bienvenue_dans_l_espace_fonctionnaire
source: Welcome to the Civil Servant space
fr: Bienvenue dans l espace Fonctionnaire

# connectez_vous_maintenant
source: Log in now
fr: Connectez-vous maintenant

# bienvenue_dans_l_espace_enseignant
source: Welcome to the Teachers Space
fr: Bienvenue dans l espace Enseignant

# contactAdministrator
source: Contact the administrator to obtain your credentials.
fr: Contactez l administrateur pour obtenir vos identifiants.

# veuillez_fournir_une_adresse_email
source: Please provide an email address
fr: Veuillez fournir une adresse e-mail

# espace_enseignants
source: Teachers Space
fr: Espace Enseignants

# ajoutee
source: Add
fr: Ajouter

# mot_de_passe
source: Password
fr: Mot de passe

# teacher_list
source: List of teachers
fr: La liste des enseignantes

# veuillez_fournir_un_mot_de_passe
source: Please provide a password
fr: Veuillez fournir un mot de passe

# le_mot_de_passe_doit_comporter_au_moins_4_caracteres
source: Password must be at least 4 characters long
fr: Le mot de passe doit comporter au moins 4 caractères

# connexion
source: Log In
fr: Connexion

# prenom
source: First Name
fr: Prénom

# realisation_par
source: Created by Abderrahmane Chaoui Omar Chouhani
fr: Réalisation par Abderrahmane Chaoui Omar Chouhani

# total_enseignants
source: Total Teachers
fr: Total des enseignants

# add_major
source: Add a major
fr: Ajouter une filière

# major_name
source: Name of the major
fr: Nom de la filière

source: No teacher
fr: Aucun enseignant

source: No major
fr: Aucun filière

# add_major_prompt
source: Please add a major
fr: Veuillez ajouter une filière

source: No students
fr: Aucun étudiant

# national_card
source: National ID card
fr: Carte nationale d identité

# national_card_of
source: National ID card: {national_card}
fr: Carte nationale d identité : {national_card}

# add_teacher_prompt
source: Please add a teacher
fr: Veuillez ajouter un enseignant

# veuillez_fournir_un_nom
source: Please provide a name
fr: Veuillez fournir un nom

# veuillez_fournir_un_prenom
source: Please provide a first name
fr: Veuillez fournir un prénom

# veuillez_fournir_un_cin
source: Please provide a National ID card
fr: Veuillez fournir la carte nationale d''identité

# email_prompt
source: Please provide an email address
fr: Veuillez fournir une adresse e-mail

# email_invalid
source: Please provide a valid email address
fr: Veuillez fournir une adresse e-mail valide

# select_gender
source: Please select a gender
fr: Veuillez sélectionner un sexe

source: Gender
fr: Genre

source: Date of Birth
fr: Date de naissance

# add_student_prompt
source: Please add a student
fr: Veuillez ajouter un étudiant

source: Cancel
fr: Annuler

# fill_all_fields
source: Please fill in all fields
fr: Veuillez remplir tous les champs

source: Delete teacher
fr: Supprimer l enseignant

source: Delete
fr: Supprimer

# student_list
source: List of Students
fr: La liste des Étudiants

source: Student Space
fr: Espace Étudiants

source: Major Space
fr: Espace Filières

source: Profile Space
fr: Espace Profil

source: Home
fr: Accueil

source: Logout
fr: Déconnexion

# module_management_space
source: Module and Element Management Space
fr: Espace de Gestion des Modules et des Éléments

# id_card_error
source: National ID card must start with a character
fr: La carte nationale d identité doit commencer par un caractère

# confirm_delete_teacher
source: Are you sure you want to delete this teacher?
fr: Êtes-vous sûr de vouloir supprimer cet enseignant ?

# selectionnez_une_option_ci_dessous_pour_commencer
source: Select an option below to start
fr: Sélectionnez une option ci-dessous pour commencer

source: Major
fr: Filière

# major_of
source: Major: {major}
fr: Filière: {major}

# school_year_of
source: School Year : {school_year}
fr: Année scolaire : {school_year}

# semester_of
source: Semester : {semester}
fr: Semestre : {semester}

# major_name_prompt
source: Please provide the name of the major
fr: Veuillez fournir un nom de la filière

# select_semester
source: Select the semester
fr: Sélectionner le semestre

# select_school_year
source: Select the school year
fr: Sélectionner l''année scolaire

# select_school_year_prompt
source: Please select a school year
fr: Veuillez sélectionner une année scolaire

source: School Year
fr: Année scolaire

source: Semester
fr: Semestre

# select_semester_prompt
source: Please select a semester
fr: Veuillez sélectionner un semestre
